Revit 2024 API
PipeFittingAndAccessoryConnectorData.LinkIndex Property
 The index of the connector which is linked with this connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int LinkIndex { get; }
Visual Basic
Public ReadOnly Property LinkIndex As Integer
	Get
Visual C++
public:
property int LinkIndex {
	int get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace